VueDotNetCore/SOAP/bodegaAuthorizerInternal.wsdl

<?xml version="1.0" encoding="utf-8"?><wsdl:definitions name="AuthorizerInternalService" targetNamespace="http://tempuri.org/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://tempuri.org/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"><wsdl:types><xsd:schema targetNamespace="http://tempuri.org/Imports"><xsd:import schemaLocation="http://localhost:8092/bodegaAuthorizerInternal?xsd=xsd0" namespace="http://tempuri.org/"/><xsd:import schemaLocation="http://localhost:8092/bodegaAuthorizerInternal?xsd=xsd1" namespace="http://schemas.microsoft.com/2003/10/Serialization/"/><xsd:import schemaLocation="http://localhost:8092/bodegaAuthorizerInternal?xsd=xsd2" namespace="http://schemas.datacontract.org/2004/07/BOdega.Common.Interface"/><xsd:import schemaLocation="http://localhost:8092/bodegaAuthorizerInternal?xsd=xsd3" namespace="http://schemas.microsoft.com/2003/10/Serialization/Arrays"/><xsd:import schemaLocation="http://localhost:8092/bodegaAuthorizerInternal?xsd=xsd4" namespace="http://schemas.datacontract.org/2004/07/BOdega.Authorizer.Interface.Internal.DataTypes"/></xsd:schema></wsdl:types><wsdl:message name="IAuthorizerInternal_TechnicianLogin_InputMessage"><wsdl:part name="parameters" element="tns:TechnicianLogin"/></wsdl:message><wsdl:message name="IAuthorizerInternal_TechnicianLogin_OutputMessage"><wsdl:part name="parameters" element="tns:TechnicianLoginResponse"/></wsdl:message><wsdl:message name="IAuthorizerInternal_Login_InputMessage"><wsdl:part name="parameters" element="tns:Login"/></wsdl:message><wsdl:message name="IAuthorizerInternal_Login_OutputMessage"><wsdl:part name="parameters" element="tns:LoginResponse"/></wsdl:message><wsdl:message name="IAuthorizerInternal_LoginToDataSource_InputMessage"><wsdl:part name="parameters" element="tns:LoginToDataSource"/></wsdl:message><wsdl:message name="IAuthorizerInternal_LoginToDataSource_OutputMessage"><wsdl:part name="parameters" element="tns:LoginToDataSourceResponse"/></wsdl:message><wsdl:message name="IAuthorizerInternal_Logout_InputMessage"><wsdl:part name="parameters" element="tns:Logout"/></wsdl:message><wsdl:message name="IAuthorizerInternal_Logout_OutputMessage"><wsdl:part name="parameters" element="tns:LogoutResponse"/></wsdl:message><wsdl:message name="IAuthorizerInternal_IsLoggedIn_InputMessage"><wsdl:part name="parameters" element="tns:IsLoggedIn"/></wsdl:message><wsdl:message name="IAuthorizerInternal_IsLoggedIn_OutputMessage"><wsdl:part name="parameters" element="tns:IsLoggedInResponse"/></wsdl:message><wsdl:message name="IAuthorizerInternal_IsLoggedInForMandator_InputMessage"><wsdl:part name="parameters" element="tns:IsLoggedInForMandator"/></wsdl:message><wsdl:message name="IAuthorizerInternal_IsLoggedInForMandator_OutputMessage"><wsdl:part name="parameters" element="tns:IsLoggedInForMandatorResponse"/></wsdl:message><wsdl:message name="IAuthorizerInternal_AuthenticateHwkUser_InputMessage"><wsdl:part name="parameters" element="tns:AuthenticateHwkUser"/></wsdl:message><wsdl:message name="IAuthorizerInternal_AuthenticateHwkUser_OutputMessage"><wsdl:part name="parameters" element="tns:AuthenticateHwkUserResponse"/></wsdl:message><wsdl:message name="IAuthorizerInternal_HashLogin_InputMessage"><wsdl:part name="parameters" element="tns:HashLogin"/></wsdl:message><wsdl:message name="IAuthorizerInternal_HashLogin_OutputMessage"><wsdl:part name="parameters" element="tns:HashLoginResponse"/></wsdl:message><wsdl:message name="IAuthorizerInternal_GetIdentInfos_InputMessage"><wsdl:part name="parameters" element="tns:GetIdentInfos"/></wsdl:message><wsdl:message name="IAuthorizerInternal_GetIdentInfos_OutputMessage"><wsdl:part name="parameters" element="tns:GetIdentInfosResponse"/></wsdl:message><wsdl:message name="IAuthorizerInternal_GetIdentInfo_InputMessage"><wsdl:part name="parameters" element="tns:GetIdentInfo"/></wsdl:message><wsdl:message name="IAuthorizerInternal_GetIdentInfo_OutputMessage"><wsdl:part name="parameters" element="tns:GetIdentInfoResponse"/></wsdl:message><wsdl:portType name="IAuthorizerInternal"><wsdl:operation name="TechnicianLogin"><wsdl:input wsaw:Action="http://tempuri.org/IAuthorizer/TechnicianLogin" message="tns:IAuthorizerInternal_TechnicianLogin_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IAuthorizer/TechnicianLoginResponse" message="tns:IAuthorizerInternal_TechnicianLogin_OutputMessage"/></wsdl:operation><wsdl:operation name="Login"><wsdl:input wsaw:Action="http://tempuri.org/IAuthorizer/Login" message="tns:IAuthorizerInternal_Login_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IAuthorizer/LoginResponse" message="tns:IAuthorizerInternal_Login_OutputMessage"/></wsdl:operation><wsdl:operation name="LoginToDataSource"><wsdl:input wsaw:Action="http://tempuri.org/IAuthorizer/LoginToDataSource" message="tns:IAuthorizerInternal_LoginToDataSource_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IAuthorizer/LoginToDataSourceResponse" message="tns:IAuthorizerInternal_LoginToDataSource_OutputMessage"/></wsdl:operation><wsdl:operation name="Logout"><wsdl:input wsaw:Action="http://tempuri.org/IAuthorizer/Logout" message="tns:IAuthorizerInternal_Logout_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IAuthorizer/LogoutResponse" message="tns:IAuthorizerInternal_Logout_OutputMessage"/></wsdl:operation><wsdl:operation name="IsLoggedIn"><wsdl:input wsaw:Action="http://tempuri.org/IAuthorizer/IsLoggedIn" message="tns:IAuthorizerInternal_IsLoggedIn_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IAuthorizer/IsLoggedInResponse" message="tns:IAuthorizerInternal_IsLoggedIn_OutputMessage"/></wsdl:operation><wsdl:operation name="IsLoggedInForMandator"><wsdl:input wsaw:Action="http://tempuri.org/IAuthorizer/IsLoggedInForMandator" message="tns:IAuthorizerInternal_IsLoggedInForMandator_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IAuthorizer/IsLoggedInForMandatorResponse" message="tns:IAuthorizerInternal_IsLoggedInForMandator_OutputMessage"/></wsdl:operation><wsdl:operation name="AuthenticateHwkUser"><wsdl:input wsaw:Action="http://tempuri.org/IAuthorizer/AuthenticateHwkUser" message="tns:IAuthorizerInternal_AuthenticateHwkUser_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IAuthorizer/AuthenticateHwkUserResponse" message="tns:IAuthorizerInternal_AuthenticateHwkUser_OutputMessage"/></wsdl:operation><wsdl:operation name="HashLogin"><wsdl:input wsaw:Action="http://tempuri.org/IAuthorizerInternal/HashLogin" message="tns:IAuthorizerInternal_HashLogin_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IAuthorizerInternal/HashLoginResponse" message="tns:IAuthorizerInternal_HashLogin_OutputMessage"/></wsdl:operation><wsdl:operation name="GetIdentInfos"><wsdl:input wsaw:Action="http://tempuri.org/IAuthorizerInternal/GetIdentInfos" message="tns:IAuthorizerInternal_GetIdentInfos_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IAuthorizerInternal/GetIdentInfosResponse" message="tns:IAuthorizerInternal_GetIdentInfos_OutputMessage"/></wsdl:operation><wsdl:operation name="GetIdentInfo"><wsdl:input wsaw:Action="http://tempuri.org/IAuthorizerInternal/GetIdentInfo" message="tns:IAuthorizerInternal_GetIdentInfo_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IAuthorizerInternal/GetIdentInfoResponse" message="tns:IAuthorizerInternal_GetIdentInfo_OutputMessage"/></wsdl:operation></wsdl:portType><wsdl:binding name="BasicHttpBinding_IAuthorizerInternal" type="tns:IAuthorizerInternal"><soap:binding transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="TechnicianLogin"><soap:operation soapAction="http://tempuri.org/IAuthorizer/TechnicianLogin" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="Login"><soap:operation soapAction="http://tempuri.org/IAuthorizer/Login" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="LoginToDataSource"><soap:operation soapAction="http://tempuri.org/IAuthorizer/LoginToDataSource" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="Logout"><soap:operation soapAction="http://tempuri.org/IAuthorizer/Logout" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="IsLoggedIn"><soap:operation soapAction="http://tempuri.org/IAuthorizer/IsLoggedIn" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="IsLoggedInForMandator"><soap:operation soapAction="http://tempuri.org/IAuthorizer/IsLoggedInForMandator" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="AuthenticateHwkUser"><soap:operation soapAction="http://tempuri.org/IAuthorizer/AuthenticateHwkUser" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="HashLogin"><soap:operation soapAction="http://tempuri.org/IAuthorizerInternal/HashLogin" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="GetIdentInfos"><soap:operation soapAction="http://tempuri.org/IAuthorizerInternal/GetIdentInfos" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="GetIdentInfo"><soap:operation soapAction="http://tempuri.org/IAuthorizerInternal/GetIdentInfo" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation></wsdl:binding><wsdl:service name="AuthorizerInternalService"><wsdl:port name="BasicHttpBinding_IAuthorizerInternal" binding="tns:BasicHttpBinding_IAuthorizerInternal"><soap:address location="http://localhost:8092/bodegaAuthorizerInternal"/></wsdl:port></wsdl:service></wsdl:definitions>